/*
;************************************************************************************************************
;*				        				北京精仪达盛科技有限公司
;*                                     	     研    发    部
;*
;*                                 	     http://www.techshine.com
;*
;*--------------------------------------------- 文件信息 ----------------------------------------------------                                      
;* 文件名称 : option.h
;* 文件功能 : 该文件为S3C44B0硬件平台的选项定义
;* 补充说明 : 
;*-------------------------------------------- 最新版本信息 -------------------------------------------------
;* 修改作者 : ARM7开发小组
;* 修改日期 : 2004/04/25
;* 版本声明 : V1.0.1
;**------------------------------------------- 历史版本信息 -------------------------------------------------
;* 文件作者 : ARM7开发小组
;* 创建日期 : 2004/04/20
;* 版本声明 : v1.0.0
;* ----------------------------------------------------------------------------------------------------------
;* ----------------------------------------------------------------------------------------------------------
;************************************************************************************************************
;*/

#ifndef __OPTION_H__
	#define __OPTION_H__

	#define MCLK  (60000000)   				                          // 系统时钟设置
	#define PLLON 1

	#if (MCLK==66000000)                                              //外部时钟输入为8MHZ
		#define PLL_M (0x3A)
		#define PLL_P (0x02)
		#define PLL_S (0x01)

	#elif (MCLK==60000000)
		#define PLL_M (0x43)
		#define PLL_P (0x03)
		#define PLL_S (0x01)

	#elif (MCLK==40000000)
		#define PLL_M (0x2A)
		#define PLL_P (0x03)
		#define PLL_S (0x01)

	#endif

	#define WRBUFOPT (0x08)   								//写缓存定义				

	#define SYSCFG_8KBn  (0x06)								//8K缓存定义	
	
	#define SYSCFG_0KB   (0x00 | WRBUFOPT) 					//内部8K 完全 SRAM 配置
	#define SYSCFG_4KB   (0x02 | WRBUFOPT) 					//内部4K cache，4K SRAM配置
	#define SYSCFG_8KB   (0x06 | WRBUFOPT) 					//内部8K 完全 cache 配置

	#define DRAM	    1					                                              // 使用DRAM 的配置
	#define SDRAM	    2					                                              // 使用SDRAM的配置
	#define BDRAMTYPE   SDRAM				

	#define BUSWIDTH    (16)                                                                  //定义总线宽度

	#define CACHECFG    SYSCFG_8KB
	
    #define _ISR_STARTADDRESS   0x0c7fff00     //GCS6:64M bits(8M字节)SDRAM
#endif 
/*
*************************************************************************************************************
**                            				结束文件													   **
*************************************************************************************************************
*/