/*
;************************************************************************************************************
;*									  北京合众思壮科技有限责任公司
;*                                     	    研    发    部
;*
;*                                 	   http://www.unistrong.com
;*
;*--------------------------------------------- 文件信息 ----------------------------------------------------                                      
;* 文件名称 : 44blib.h
;* 文件功能 : 该文件声明S3C44B0硬件平台的通用函数的头文件
;* 补充说明 : 
;*-------------------------------------------- 最新版本信息 -------------------------------------------------
;* 修改作者 : ARM7开发小组
;* 修改日期 : 2004/04/25
;* 版本声明 : V1.0.1
;*-------------------------------------------- 历史版本信息 -------------------------------------------------
;* 文件作者 : ARM7开发小组
;* 创建日期 : 2004/04/20
;* 版本声明 : v1.0.0
;*-----------------------------------------------------------------------------------------------------------
;*-----------------------------------------------------------------------------------------------------------
;************************************************************************************************************
;*/

#ifndef __44blib_h__

	#define __44blib_h__
	#define NULL 0
	#define EnterPWDN(clkcon) ((void (*)(int))0x20080e0)(clkcon) //?????????//0xc0080e0

	void Delay(int time); 
	void *malloc(unsigned nbyte); 
	void free(void *pt);
	void Port_Init(void);
	void Cache_Flush(void);
	void Uart_TxEmpty(char port);
	void Uart_Init(int mclk,int baud,char port);
	char Uart_Getch(char port);
	char Uart_GetKey(char port);
	int  Uart_GetIntNum(char port);
	void Uart_SendByte(int data,char port);
	void Uart_Printf(char port,char *fmt,...);
	void Uart_SendString(char *pt,char port);

	void Timer_Start(int divider); 					
	int  Timer_Stop(void);          					

	void ChangePllValue(int m,int p,int s);

	#ifdef __cplusplus
		}
	#endif

#endif 
/*
*************************************************************************************************************
**                            				结束文件													   **
*************************************************************************************************************
*/
